---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelImage
source: html/a1e85ef4-7255-b866-77c8-d3a100e432ed.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelImage Property

"Image"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelImage { get; }
```